In [84]:
import torch

In [5]:
# from annoy import AnnoyIndex
import numpy as np
import matplotlib.pyplot as plt

In [6]:
x = np.arange(20)
z = np.arange(20)
y = np.arange(20)

In [14]:
# %matplotlib 
# fig = plt.figure()

# ax = fig.add_subplot(projection = "3d")

# ax.plot(x,y,z)
# # plt.show()

In [15]:
import pandas as pd

In [25]:
columns = ['one','two','three']
# print(columns)
c = list("mike")
c

['m', 'i', 'k', 'e']

In [45]:
df = pd.DataFrame(np.random.randn(10,4),columns = ['one','two','three','four'])

In [46]:
df

        one       two     three      four
0  0.963618 -0.671287 -1.482716 -0.373524
1  0.744831 -1.447950 -0.978319 -0.758456
2 -0.118456 -0.139582  1.047767  0.617853
3  1.419265 -0.254698 -1.683950  0.379938
4  0.336643 -0.711584 -0.195520  0.067531
5 -0.164517 -0.080191 -1.923876  0.418021
6 -0.278895 -0.091543  0.264278  1.702819
7 -0.804648 -0.344587 -0.275232  0.801488
8 -0.565384  1.153492 -1.153563  0.270004
9  1.391183  0.050143 -0.444773  0.262807

In [42]:
df2 = pd.DataFrame(np.random.randn(10,2),columns = list("ab"))

In [43]:
df2.head()

          a         b
0 -1.052051 -1.104235
1 -0.993212  0.883707
2 -0.713155  1.331890
3  0.819217  2.178463
4 -1.951374  0.763125

In [44]:
df2[0:1]

          a         b
0 -1.052051 -1.104235

In [48]:
pieces = [df,df2]

In [49]:
type(pieces)

list

In [54]:
df3 = pd.concat(pieces,ignore_index = True)

In [55]:
df3

         one       two     three      four         a         b
0   0.963618 -0.671287 -1.482716 -0.373524       NaN       NaN
1   0.744831 -1.447950 -0.978319 -0.758456       NaN       NaN
2  -0.118456 -0.139582  1.047767  0.617853       NaN       NaN
3   1.419265 -0.254698 -1.683950  0.379938       NaN       NaN
4   0.336643 -0.711584 -0.195520  0.067531       NaN       NaN
5  -0.164517 -0.080191 -1.923876  0.418021       NaN       NaN
6  -0.278895 -0.091543  0.264278  1.702819       NaN       NaN
7  -0.804648 -0.344587 -0.275232  0.801488       NaN       NaN
8  -0.565384  1.153492 -1.153563  0.270004       NaN       NaN
9   1.391183  0.050143 -0.444773  0.262807       NaN       NaN
10       NaN       NaN       NaN       NaN -1.052051 -1.104235
11       NaN       NaN       NaN       NaN -0.993212  0.883707
12       NaN       NaN       NaN       NaN -0.713155  1.331890
13       NaN       NaN       NaN       NaN  0.819217  2.178463
14       NaN       NaN       NaN       NaN -1.951374  0.763125
15       NaN       NaN       NaN       NaN  1.828199 -2.452717
16       NaN       NaN       NaN       NaN -0.944376  0.560804
17       NaN       NaN       NaN       NaN  0.084206 -0.424064
18       NaN       NaN       NaN       NaN  0.825222  0.545104
19       NaN       NaN       NaN       NaN -1.015236  1.092305

In [57]:
df.head()

        one       two     three      four
0  0.963618 -0.671287 -1.482716 -0.373524
1  0.744831 -1.447950 -0.978319 -0.758456
2 -0.118456 -0.139582  1.047767  0.617853
3  1.419265 -0.254698 -1.683950  0.379938
4  0.336643 -0.711584 -0.195520  0.067531

In [58]:
df.tail()

        one       two     three      four
5 -0.164517 -0.080191 -1.923876  0.418021
6 -0.278895 -0.091543  0.264278  1.702819
7 -0.804648 -0.344587 -0.275232  0.801488
8 -0.565384  1.153492 -1.153563  0.270004
9  1.391183  0.050143 -0.444773  0.262807

In [63]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],'B'['one', 'one', 'two', 'three',
 'two', 'two', 'one', 'three'], 'C': np.random.randn(8),
 'D': np.random.randn(8)})

SyntaxError: invalid syntax (<ipython-input-63-1c4c41892213>, line 2)

In [64]:
df2 = pd.DataFrame({'X': ['B', 'B', 'A', 'A'], 'Y': [1, 2, 3, 4]})

In [65]:
df2

   X  Y
0  B  1
1  B  2
2  A  3
3  A  4

In [71]:
# df2.groupby(['x']).sum
df2.groupby(['X']).count()

   Y
X
A  2
B  2

In [73]:
df2.groupby(['X'],sort = False).sum()

   Y
X
B  3
A  7

In [74]:
df2.groupby(['X']).get_group('B')

   X  Y
0  B  1
1  B  2

In [79]:
df2

   X  Y
0  B  1
1  B  2
2  A  3
3  A  4

In [80]:
grouped = df2.groupby('X')

In [82]:
print(grouped)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000026A547874F0>

In [83]:
grouped.aggregate(np.sum())

TypeError: _sum_dispatcher() missing 1 required positional argument: 'a'

In [85]:
import nltk